In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from config import username
from config import password

In [2]:
from sqlalchemy import create_engine
#engine = create_engine('postgresql://localhost:8890/SQL Pewlett Hackard')
#connection = engine.connect()

In [3]:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/SQL Pewlett Hackard')

In [4]:
connection = engine.connect()

In [5]:
salary_range = pd.read_sql("SELECT * FROM salaries", engine)
salary_range

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]